{
    "calculator": [

        {
            "calc": {
                "name": "Ti-84 plus CE",
                "summary": "Familiar TI-84 Plus functionality in a sleek new design that features a crisp color screen",
                "overview": "Texas Instruments announced on January 27, 2015 a colorful addition to the TI-84 Plus family of graphing calculators - the new TI-84 Plus CE and successor of the TI-84 Plus C Silver Edition introduced just 2 years earlier.It features full-color capabilities, a high-resolution, back-lit screen, rechargeable batteries and an updated operating system in a housing 30 percent thinner and 30% lighter than the outgoing mode and yet sporting six times the memory and operating at three times the speed.",
                "image": "ti84PCE.jpeg",
                "specifications": "<ul><li>Screen size: 320 x 240 pixels (2.8'' diagonal)</li><li>Screen resolution: 140 DPI; 16-bit color</li><li>154KB of available RAM memory</li><li>3 MB FLASH ROM memory</li><li>USB port for computer connectivity</li><li>Internal Clock with date and time display</li><li>eZ80 microprocessor clocked at 48MHz</li></ul>",
                "price": "189.98"
            }
}, {
            "calc": {
                "name": "Ti-84 plus",
                "summary": "Ideal for use in Algebra 1 and 2, trigonometry, business/finance, biology and physics, the TI-84 Plus has three times the storage capacity of the TI-83 Plus with 30 available App slots.",
                "overview": "Expanded graphing technology performance comes preloaded with more than a dozen applications, including functionality that encourages exploration of interactive geometry, inequality graphing and real-world data collection and analysis. The TI-84 Plus Graphing Calculator is ideal for high school math and science. Its MathPrint™ technology engages students by enabling them to enter fractions and equations in proper notation to they see it on the display exactly as it’s printed in texts and on the board. Standardized testing organizations have approved the TI-84 Plus calculator for use on the PSAT, SAT, and ACT college entrance exams, IB and AP tests.",
                "image": "ti84P.png",
                "specifications": "<ul><li>8-line by 16-character display</li><li>480 KB ROM memory for data archive and storage of Apps</li><li>24KB of available RAM memory</li><li>Powered by 4 AAA batteries with a lithium battery backup</li><li>TI Connectivity Cable included</li><li>numbers calculated to 14-digit accuracy</li></ul>",
                "price": "167.94"
            }
}, {
            "calc": {
                "name": "Ti-89 Titanium",
                "summary": "The TI-89 Titanium is the next generation of TI's most powerful educational handheld for use in advanced mathematics and science courses.",
                "overview": "This versatile graphing calculator features advanced functionality and 3-D graphing that makes problem-solving for AP*, advanced mathematics and engineering courses easier. Built-in Computer Algebra System (CAS) allows you to explore and manipulate mathematical expressions in symbolic form. Visualize and edit complex expressions. The calculator’s Pretty Print feature is an innovative enhancement that displays equations and results with radical notation, stacked fractions and superscript exponents.Solve equations symbolically; factor and expand variable expressions; complete the square; and find anti-derivatives, computer limits and exact solutions in irrational forms on a powerful CAS platform.",
                "image": "ti89T.jpg",
                "specifications": "<ul><li>Powered by 4 AAA batteries with Lithium battery backup</li><li>About 188 K bytes of user-available RAM</li><li>100 x 160 pixel display</li><li>out 2.7 MB of user-available Flash ROM</li><li>Internal clock with date and time display</li><li>Optional assembly language programming</li><li>Real time rotation of 3-D surfaces</li><li>Hexadecimal and binary operations and conversions</li></ul>",
                "price": "236.32"
            }
}, {
            "calc": {
                "name": "Ti-nspire CX CAS",
                "summary": "Our most powerful Computer Algebra System handheld that enables a deeper understanding of abstract concepts in math and science subjects.",
                "overview": "The TI-Nspire™ CX CAS provides algebraic capability to symbolically solve equations, factor and expand variable expressions, complete the square, find antiderivatives, computer limits and exact solutions in irrational forms, making it a robust hands-learning tool that satisfies math and science curriculum needs from middle school through college. The TI-Nspire™ CX CAS handheld’s innovative capabilities support teaching strategies that research has found accelerate understanding of complex mathematic and scientific concepts. The ti-nspire CX CAS features a dedicated programming environment as well as programming libraries for global access to user-defined functions & programs. Standardized testing organizations have approved the TI-Nspire CX CAS handheld for SAT, AP and PSAT/NMSQT high-stakes exams. It is also approved for some state exams.",
                "image": "tinspireCXCAS.jpg",
                "specifications": "<ul><li>320 x 240 pixel color backlit display</li><li>125 DPI; 16-bit color</li><li>100 MB storage memory</li><li>64MB operating memory</li><li>TI Rechargeable Battery</li><li>ET-LC2010B-0 (T6UJ1XBG-0002) Processor</li><li>CPU speed of 132 MHz</li></ul>",
                "price": "200.63"
            }
}, {
            "calc": {
                "name": "Ti-nspire CX",
                "summary": "Our latest graphing handheld that enables a deeper understanding of abstract concepts in math and science subjects.",
                "overview": "The TI-Nspire™ CX handheld is a robust, hands-on learning tool that satisfies math and science curriculum needs from middle school through college. The TI-Nspire™ CX handheld’s innovative capabilities support teaching strategies that research has found accelerate understanding of complex mathematic and scientific concepts. Integrated mathematics templates permit students to enter expressions and see math symbols, formulas and stacked fractions just as they are printed in textbooks and on the board. Standardized testing organizations have approved the TI-Nspire™ CX handheld for SAT*, PSAT/NMSQT*, ACT*, AP* and IB* high-stakes exams. It also is approved for some state exams.",
                "image": "tinspireCX.jpg",
                "specifications": "<ul><li>Color, backlit display</li><li>Screen size: 320 x 240 pixels (3.5'' diagonal)</li><li>Screen resolution: 125 DPI; 16-bit color</li><li>100 MB storage memory / 64MB operating memory</li><li>Powered by the TI-Rechargeable Battery (included)</li><li>USB port for computer connectivity</li></ul>",
                "price": "189.98"
            }
}, {
            "calc": {
                "name": "Ti-83 plus",
                "summary": "Easy-to-use graphing calculator for math and science that lets students graph and compare functions, as well as perform data plotting and analysis.",
                "overview": "A serial port of the calculators allows the connection to the Calculator-Based Laboratory system CBL, its successor CBL 2, the Calculator-Based Ranger CBR and its successor CBR 2. Supports an optional full-sized QWERTY Keyboard for a more convenient entry of notes into the handhelds. Introduced in 1999 as the successor of the TI-83, it was an immediate success on the market and it was for a long time frame the best selling graphing calculator in the US and Canada. The TI-83 Plus is permitted (as of September 27, 2007) for use on SAT, ACT, PSAT and AP exams.",
                "image": "ti83P.jpg",
                "specifications": "<ul><li>160 KB FLASH ROM memory for data archive and storage of apps.</li><li>24 KB of available RAM memory.</li><li>Eight-line by 16-character display.</li><li>TI-GRAPH LINK™ cable available.</li><li>Lists store up to 999 elements.</li><li>Zilog Z84C00 microprocessor clocked at 15 MHz</li><li>13 pre-loaded software applications</li></ul>",
                "price": "134.04"
            }
}, {
            "calc": {
                "name": "Ti-73 explorer",
                "summary": "Designed specifically for middle-grades mathematics and science, the TI-73 Explorer™ graphing calculator is the ideal teaching and learning tool to help students build proficiency and confidence.",
                "overview": "Enhance your students’ learning experience with the TI-73 Explorer™, which serves as a bridge between the TI-15 Explorer™ and the TI-84 Plus Family. Designed for middle grades math and science, this graphing calculator encourages fraction exploration and supports interactive learning and data-collection. Fraction capability includes step-by-step simplification and operations, including conversions between fractions, mixed numbers, and decimals. Standardized testing organizations have approved the TI-73 calculator for use on the PSAT, SAT, and AP tests.",
                "image": "ti73E.jpg",
                "specifications": "<ul><li>64 × 96 pixel screen</li><li>Eight-line × 16-character LCD display</li><li>32 K bytes RAM with 25 K user-available</li><li>128 K of application space (with OS v. 1.60)</li><li>Supports TI Basic programming</li><li>Powered by four (4) AAA batteries with lithium battery backup</li><li>Indicates when fraction can be simplified</li></ul>",
                "price": "84.59"
            }
}
]
}
